/* automatically generated by rust-bindgen 0.69.4 */

#[repr(C)]
#[derive(Copy, Clone)]
pub struct _sgx_ql_qve_collateral_t {
    pub __bindgen_anon_1: _sgx_ql_qve_collateral_t__bindgen_ty_1,
    #[doc = "<  0x00000000: SGX or 0x00000081: TDX"]
    pub tee_type: u32,
    pub pck_crl_issuer_chain: *mut ::core::ffi::c_char,
    pub pck_crl_issuer_chain_size: u32,
    pub root_ca_crl: *mut ::core::ffi::c_char,
    #[doc = " Root CA CRL"]
    pub root_ca_crl_size: u32,
    pub pck_crl: *mut ::core::ffi::c_char,
    #[doc = " PCK Cert CRL"]
    pub pck_crl_size: u32,
    pub tcb_info_issuer_chain: *mut ::core::ffi::c_char,
    pub tcb_info_issuer_chain_size: u32,
    pub tcb_info: *mut ::core::ffi::c_char,
    #[doc = " TCB Info structure"]
    pub tcb_info_size: u32,
    pub qe_identity_issuer_chain: *mut ::core::ffi::c_char,
    pub qe_identity_issuer_chain_size: u32,
    pub qe_identity: *mut ::core::ffi::c_char,
    #[doc = " QE Identity Structure"]
    pub qe_identity_size: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _sgx_ql_qve_collateral_t__bindgen_ty_1 {
    #[doc = "< 'version' is the backward compatible legacy representation"]
    pub version: u32,
    pub __bindgen_anon_1: _sgx_ql_qve_collateral_t__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _sgx_ql_qve_collateral_t__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "< the CRLs will be formatted in PEM. For PCS V3 APIs, the major_version = 3 and the"]
    pub major_version: u16,
    #[doc = "< minor_version can be either 0 or 1. minor_verion of 0 indicates the CRL’s are formatted\n< in Base16 encoded DER.  A minor version of 1 indicates the CRL’s are formatted in raw binary DER."]
    pub minor_version: u16,
}
#[test]
fn bindgen_test_layout__sgx_ql_qve_collateral_t__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_sgx_ql_qve_collateral_t__bindgen_ty_1__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_sgx_ql_qve_collateral_t__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_sgx_ql_qve_collateral_t__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<_sgx_ql_qve_collateral_t__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(_sgx_ql_qve_collateral_t__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).major_version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(major_version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).minor_version) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(minor_version)
        )
    );
}
#[test]
fn bindgen_test_layout__sgx_ql_qve_collateral_t__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_sgx_ql_qve_collateral_t__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_sgx_ql_qve_collateral_t__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_sgx_ql_qve_collateral_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<_sgx_ql_qve_collateral_t__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_sgx_ql_qve_collateral_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t__bindgen_ty_1),
            "::",
            stringify!(version)
        )
    );
}
#[test]
fn bindgen_test_layout__sgx_ql_qve_collateral_t() {
    const UNINIT: ::core::mem::MaybeUninit<_sgx_ql_qve_collateral_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_sgx_ql_qve_collateral_t>(),
        120usize,
        concat!("Size of: ", stringify!(_sgx_ql_qve_collateral_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_sgx_ql_qve_collateral_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_sgx_ql_qve_collateral_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tee_type) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t),
            "::",
            stringify!(tee_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pck_crl_issuer_chain) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t),
            "::",
            stringify!(pck_crl_issuer_chain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pck_crl_issuer_chain_size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t),
            "::",
            stringify!(pck_crl_issuer_chain_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).root_ca_crl) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t),
            "::",
            stringify!(root_ca_crl)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).root_ca_crl_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t),
            "::",
            stringify!(root_ca_crl_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pck_crl) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t),
            "::",
            stringify!(pck_crl)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pck_crl_size) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t),
            "::",
            stringify!(pck_crl_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tcb_info_issuer_chain) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t),
            "::",
            stringify!(tcb_info_issuer_chain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tcb_info_issuer_chain_size) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t),
            "::",
            stringify!(tcb_info_issuer_chain_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tcb_info) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t),
            "::",
            stringify!(tcb_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tcb_info_size) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t),
            "::",
            stringify!(tcb_info_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).qe_identity_issuer_chain) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t),
            "::",
            stringify!(qe_identity_issuer_chain)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).qe_identity_issuer_chain_size) as usize - ptr as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t),
            "::",
            stringify!(qe_identity_issuer_chain_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).qe_identity) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t),
            "::",
            stringify!(qe_identity)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).qe_identity_size) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_sgx_ql_qve_collateral_t),
            "::",
            stringify!(qe_identity_size)
        )
    );
}
pub type sgx_ql_qve_collateral_t = _sgx_ql_qve_collateral_t;
